{"website": "Jason Hunter - Lawyer in Farmington, UT - Avvo", "post_site_url": "www.avvo.com", "biz_logo_link": "", "biz_favicon": "www.avvo.com/favicon.ico?v=2", "post_review_link": "https://www.avvo.com/attorney-reviews/84025-ut-jason-hunter-284784/write_review.html", "reviews": [{"name": " Sarah Jane Jennings", "date": "Tue May 04 2010", "avatar": "", "rating": "5", "title": "Great Work", "description": "Jason is efficient, knowledgable and honest in his work. He worked very hard and kept us informed regarding our situation. He is very pleasant and professional to work with. I would recommend him to anyone!", "source": ""}, {"name": " Kevin", "date": "Wed May 12 2010", "avatar": "", "rating": "5", "title": "Great Estate Planning Attorney", "description": "Jason is very knowledgeable and easy to work with. He helped us with our estate planning (trust) and had some excellent suggestions we hadn't considered.", "source": ""}, {"name": " Doreen", "date": "Wed May 12 2010", "avatar": "", "rating": "5", "title": "Thorough and very detailed", "description": "Mr. Hunter was very knowledgeable in his field and we felt very confident in how he handled our legal matters. It brought us peace of mind to know our legal matters were handled properly and thoroughly. We felt his sincere interest in our needs and answered any questions we had regarding our legal issues. We will recommend with confidence anyone we know who needs help with the services Mr. Hunter offers.", "source": ""}, {"name": " Mary", "date": "Wed May 12 2010", "avatar": "", "rating": "5", "title": "Jason C. Hunter", "description": "Jason has done some work for me and I would recommend him to anyone. I felt he gave me excellent counseling and did a thorough job of going over all my options.", "source": ""}, {"name": " anonymous", "date": "Wed May 12 2010", "avatar": "", "rating": "5", "title": "Estate Plan from Jason Hunter", "description": "Jason Hunter was great to work with. Jason and his staff were very organized and professional. He was very personal and concerned about my personal situation. Jason quickly finished my estate plan and it was a good price for the services I received. I have recommended Jason to my family and friends.", "source": ""}]}