{"website": "Taylor Kia of Boardman - Youngstown, OH: Read consumer reviews, browse dealership amenities and service promotions", "post_site_url": "www.cargurus.com", "biz_logo_link": " ", "biz_favicon": "https://static1.cargurus.com/gfx/icons/Favicon-48x48.png", "post_review_link": "https://www.cargurus.com/Cars/lan-Taylor-Kia-of-Boardman-sp327449#dealerReviewVerificationModal", "reviews": [{"name": "Home", "date": "Jan 28, 2021", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "1", "title": "", "description": "This truck was listed as ready to go. When I went to pick it up I was told it had a dash switch that needed replaced. It has been 9 days they’ve had the truck and now telling me they can’t fix it. I bought the truck 10 days ago because I need to drive cross country and 3 days from leaving, I have no vehicle. Right now I have been waiting almost an hour and a half for the general manager and my salesman to call me back.\r\nI am cancelling my sale and will shop somewhere else.", "source": ""}, {"name": "Research", "date": "Jan 22, 2021", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "4", "title": "", "description": "Responsive", "source": ""}, {"name": "Youngstown", "date": "Dec 14, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "5", "title": "", "description": "Dealer got in touch with me very soon after my inquiry. He sent me swiftly out of the door price including delivery fee and tax in Virginia. Signing documents and sending check was question of one hour. All documents came overnight in 24 h. My car should be delivered after tomorrow. It was pleasure doing business with Kia Boardman and especially Bart.", "source": ""}, {"name": "Taylor Kia of Boardman", "date": "Nov 12, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "4", "title": "", "description": "Staff worked well with me", "source": ""}, {"name": "Guru9521F6", "date": "Nov 6, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "2", "title": "", "description": "I did purchase the vehicle and I love it, but here’s my issue. I had told the rep that it is very important for my family to have two sets of keys for my new car. He said that the car was the managers car that she had traded in and would check for the second set. I spoke with him twice the day I was to pick up the car and sent 2 emails advising it’s IMPERATIVE for me to have two sets of keys. Long story short.. the dealership didn’t take my request into consideration. Had an extremely rude rep confront me and my boyfriend when we asked for a manager as soon as we walked in. Once the situation was resolved. The rude rep didn’t show us to the car, on how things work, to go over the detailing. He was so childish he literally handed me the keys and stormed out of the show room. I feel management condones this type of behavior and didn’t apologize for his associates actions. I am thankful for my initial experience and the manual.", "source": ""}, {"name": "Jesse", "date": "Aug 30, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "5", "title": "", "description": "Very helpful", "source": ""}, {"name": "Guru7V4BW", "date": "Jun 9, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "5", "title": "", "description": "Great experience.  Did not buy a car but would go back there again.", "source": ""}, {"name": "ctarby", "date": "May 28, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "5", "title": "", "description": "Ridge was wonderful. I made an online inquiry. Ridge called back and made everything east as 1-2-3. I explained I was over 8 hrs away so when I came I wanted everything to go smoothly. Ridge had everything lined up and recognized me and my crew when we walked on to the lot.  An hour later we had the keys in hand and were pulling off. Thanks Ridge/Kia!!", "source": ""}, {"name": "Guru6WMNY", "date": "May 19, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "4", "title": "", "description": "I did not buy the car I had questions on so I didn’t go through the whole process. The dealership contacted me right away answered and sent photos I requested through text very quickly.", "source": ""}, {"name": "Jarrod", "date": "Apr 19, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "5", "title": "", "description": "Wonderful", "source": ""}, {"name": "Mnuky", "date": "Mar 29, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "3", "title": "", "description": "very courteous and prompt with emails, but extremely difficult to call and get a hold of people.  tried the chat \r\nand that was impossible to get any information, annoying just getting questions from the chat person.", "source": ""}, {"name": "DonM1957", "date": "Mar 24, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "5", "title": "", "description": "They're very good about contacting me, in quarantine so I couldn't do anything", "source": ""}, {"name": "Shelly", "date": "Mar 10, 2020", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "5", "title": "", "description": "Great experience", "source": ""}, {"name": "Benjamin", "date": "Nov 3, 2019", "avatar": "https://static.cargurus.com/images/site/2019/10/31/16/25/pic-8583491336498387163-1600x1200.png", "rating": "5", "title": "", "description": "They contacted me right away after saying that I was interested in the car on CarGurus then got me in for an appointment. Great place, sales person Luis was very friendly and helpful! Car was clean and took it for test drive. The only thing i could say on the downside of my experience there while buying my 2013 Ford Fusion was how slow it was in the financial aspect but it was a busy day also. I would recommend them for buying a car!!  I liked how they didn't pressure me into buying the car i didn't feel like i was obligated or forced into it , a big plus in my opinion. Anyhow its a great place! Good service and I'm glad i drove the 3+ hrs there to look at and end up buying the car only had it one day now but love it!!", "source": ""}, {"name": "David", "date": "Oct 20, 2019", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "5", "title": "", "description": "Drove there for 2.5 hrs from Columbus and our drive was totally worthy it. Went to go see the Genesis and to test drive it and ended driving back in the Genesis.\r\nThe experience was top notch especially the sales guy Dan. He made us feel welcome and explained all the features of the car before test driving it. The Finance guy too never pressured us to buy stuff like gap and extended warranty. Go visit Taylor Kia and make sure you ask for Dan. Thank you Dan", "source": ""}, {"name": "shaybarger", "date": "Oct 5, 2019", "avatar": "https://static1.cargurus.com/gfx/cg/user-noPic_vector.svg", "rating": "4", "title": "", "description": "Courteous and informative received within 24 hours.", "source": ""}]}