{"website": "Haus Auto Group - Used Car Dealer - Dealership Ratings", "post_site_url": "www.dealerrater.com", "post_review_link": "www.dealerrater.com/consumer/writereviews/0", "biz_logo_link": "https://www.dealerrater.com/ncdn/s/185.20210203.3/Graphics/locales/en-US/logo_dealerrater_updated.png", "biz_favicon": "www.dealerrater.comhttps://www.dealerrater.com/ncdn/s/185.20210203.3/Graphics/favicon.ico", "reviews": [{"name": "Rand", "date": "January 29, 2021", "avatar": "", "rating": "", "title": "HI All! This Is Rand owner of Rolling Mills Bar & Grill...", "description": "HI All! This Is Rand owner of Rolling Mills Bar & Grill Girard Ohio. I Purchased a 2020 Siliverado from Lisa and Ron early December. Been down with Covid for a few weeks and now just back to normal and getting a chance to respond about my purchase. I want to say Lisa and Ron were awesome to work with. As a General Motors employee for 42 years this was the first used vehicle purchase I made since 1978. Everything went perfect! I would highly recommend the Haus Auto Group! 5 Stars plus. Ask for Lisa :))", "source": "Lisa & Ron "}, {"name": "Mike", "date": "January 15, 2021", "avatar": "", "rating": "", "title": "We had a great experience here at Haus. They went above...", "description": "We had a great experience here at Haus. They went above and beyond our expectations when we purchased my wife’s car. When I am ready for a new car I know where I will be going.", "source": "Frank "}, {"name": "Natasha", "date": "September 04, 2020", "avatar": "", "rating": "", "title": "Initial communication with Jeff was super easy through...", "description": "Initial communication with Jeff was super easy through text messages that i prefer over phone calls. He is knowledgeable and very professional. I researched prices on vehicles for about a week and they had the best deal.", "source": "Jeff Loy "}, {"name": "Dana M Roth", "date": "September 04, 2020", "avatar": "", "rating": "", "title": "I highly recommend Haus Auto Group. Jeff Loy made my...", "description": "I highly recommend Haus Auto Group. Jeff Loy made my experience like none other. Everything was taken care of and approved before I even walked in the door. After a test drive, I signed and was in my way. Jeff was very knowledgeable, laid back and professional. I've purchased a few cars and it would be an all day, back and forth exhausting ordeal. Not with Jeff, was in and out with a beautiful car top notch warranty and a smile on my face. Go see him, you won't be disappointed!", "source": "Jeff Loy "}, {"name": "ewilkins14", "date": "August 31, 2020", "avatar": "", "rating": "", "title": "I always have a great experience with haus auto ,...", "description": "I always have a great experience with haus auto , especially with Dom and Ron and I can’t leave out out Brian from the service department. What a great dealership.", "source": "Ron , Dom , Brian , Chris and ? (Forgot name) "}, {"name": "John", "date": "August 28, 2020", "avatar": "", "rating": "", "title": "My wife and I were very happy with our buying experience...", "description": "My wife and I were very happy with our buying experience from Haus Auto. Jeff and Dom were as easy going as you could get, and made the whole process quick, fun, and simple.", "source": "Jeff, Dom "}, {"name": "Ron Vernon", "date": "August 22, 2020", "avatar": "", "rating": "", "title": "I purchased a vehicle and was very pleasantly surprised....", "description": "I purchased a vehicle and was very pleasantly surprised. I very much felt appreciated at first contact with them.\r\nno B/S or pressure at all.\r\nI WILL BE BACK for my other vehicle replacements.", "source": "Dom,Ron Haus,Brian. "}, {"name": "Rich", "date": "August 21, 2020", "avatar": "", "rating": "", "title": "This is a great dealership with fair prices. Lisa was...", "description": "This is a great dealership with fair prices. Lisa was wonderful to work with. I was in and out. I would highly recommend working with Lisa.", "source": "Lisa  "}, {"name": "nicokinner", "date": "August 01, 2020", "avatar": "", "rating": "", "title": "Great people, they would not settle unless i was totally...", "description": "Great people, they would not settle unless i was totally happy. I was there for a car but they were truely there for me. Awesome!", "source": "Frank "}, {"name": "Njwiery", "date": "July 01, 2020", "avatar": "", "rating": "", "title": "Hands down the best preowned car dealership in the state....", "description": "Hands down the best preowned car dealership in the state. My sales rep, Lisa Sefcik, was always available and easy as possible to communicate with to match up a time for a test drive. The customer service that Haus provides should be written in a training manual—— cannot get any better.\r\nI can say based on my first experience buying a used vehicle, I will never go anywhere else besides Haus. Thank you!!!!!!", "source": "Lisa Sefcik  "}]}