{"website": "Jennifer W Allen, MD - Salt Lake City, UT - Family Doctor | Doctor.com", "post_site_url": "www.doctor.com", "biz_logo_link": "https://www.doctor.com/images/logo-dark.png", "biz_favicon": "https://assets/2687f60d/images/favicon.ico?v=10681", "post_review_link": "https://www.doctor.com/Dr-Jennifer-Allen-8", "reviews": [{"name": "R. W.", "date": "09/23/2020", "avatar": "", "rating": "", "title": "Dr. Jen is the best!", "description": "I have been coming here for seven years and I look as young and beautiful as I did seven years ago,  thanks to Dr. Jen.  She keeps me looking lovely and fresh, never overdone.  I look and feel like the best version of myself.  She takes the time to understand your beauty goals and explain how to attain them.  You will look and feel amazing!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "07/14/2020", "avatar": "", "rating": "", "title": "AMAZING", "description": "I love Dr. Allen and her staff...Iv'e had nothing\nbut great experiences with Portica.  would recommend Portica for all your needs.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Ginger D.", "date": "07/14/2020", "avatar": "", "rating": "", "title": "I am really happy with the outcome of my procedure.", "description": "Dr Allen is very imformative and makes you feel comfident in the work that she does. She is always availble to answer questions from the very first appointment.  Dr. Allen made everything easy and comfortable before, during and after the procedure. I would do it again in a heartbeat.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "J. B.", "date": "07/13/2020", "avatar": "", "rating": "", "title": "Great results!", "description": "Dr. Allen has a wonderful bedside manor that puts you ease the moment you walk in.  She aswered all my question in a thoughtul way and never made me feel rushed.  I especially appreciated her candidness in telling me what procedures would not really benefit  me.  I am very pleased with my results.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "K. L.", "date": "07/07/2020", "avatar": "", "rating": "", "title": "Great Experience", "description": "I've gotten injections from Dr. Allen for the past 5 years. I would not trust anyone else. Lips, undereyes, smile lines, and Botox. Sounds like a lot when added up, but looks very natural. I recommend all my friends.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "A. E.", "date": "07/07/2020", "avatar": "", "rating": "", "title": "I will never go to anyone else!", "description": "Dr. Allen is so good with making her work look entirely natural and beautiful. She knows how to look at a face and tell exactly what will enhance it in the best way. I was worried about getting lip fillers because I heard they can hurt, but she did such an incredible job that I barely felt the injections and had such a positive experience. Dr. Allen is professional, genuine, and is an absolute wizard at what she does!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "M. W.", "date": "06/22/2020", "avatar": "", "rating": "", "title": "Dr. Allen is amazing.", "description": "Dr. Allen\nI just love her. She definitley knows how to sculp the body in a way to keep your figure, but makes a change for the better. I have tried to lose the fat on my own with diet and exercise and there were a few areas that just would not go away. She listened to me and knew how to help me look my best. She was there always after my procedure and that gave me great comfort. \nI would deinitley use Dr Allen for all your cosmetic needs.  \nMW", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "06/22/2020", "avatar": "", "rating": "", "title": "Amazing", "description": "Love Dr Allen and Staff...It was truly a great experience.  I am so pleased with the results and would recommend Portica to anyone wanting to better themselves.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "03/17/2020", "avatar": "", "rating": "", "title": "AMAZING AMAZING AMAZING", "description": "I have always been nervous to have any kind of surgery.  I heard about Dr. Allen from a friend and decided to have a consultation on some liposuction I have wanted for years.  My experience was amazing from start to finish.  I felt comfortable and in good hands the two days of surgery.  I recovered well and I'm very happy with my results.  Dr. Allen is not only an artist and great at what she does but she's a very caring and beautiful person that listens to you and wants the best for you.  Love her. \nSamantha her assistant was accommodating and helpful during the whole process and a great addition to the team.  I can't say enough good things about my experience.  Like I said,  AMAZING!!!!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "V. L.", "date": "03/03/2020", "avatar": "", "rating": "", "title": "so pleased with results !", "description": "Dr. is very professional and a pleasure to work with. I would\nrecommend her highly! I feel years younger.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "C. J.", "date": "02/11/2020", "avatar": "", "rating": "", "title": "LOVE my results!", "description": "Dr. Allen and her team provided an absolutely wonderful experience before, during, and after my body contouring procedure. Dr. Allen listened carefully to what I wanted out of the procedure and delivered beyond my expectations. I would 100% recommend Portica to anyone looking to enhance their appearance.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "A. M.", "date": "02/04/2020", "avatar": "", "rating": "", "title": "she is amazing and an incredible artist", "description": "she did lipo to my bottom half I can not wait to do the upper half the transformation is amazing, after the lipo my butt is more defined it is crazy how I like to put jeans on now. I travel a far distance to see her. botox and filler she is an artist and spends so much time with me and makes me feel important", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "01/06/2020", "avatar": "", "rating": "", "title": "Excellent experience-highly recommend!!", "description": "I love the new shape my body has taken after my procedure with Dr. Allen! She was patient, kind, and went above and beyond. I would recommend her to anyone looking to get a cosmetic procedure done.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "J. W.", "date": "12/18/2019", "avatar": "", "rating": "", "title": "Incredible results! I should've done this sooner!", "description": "Dr. Jennifer Allen is the most attentive doctor, taking time and her wealth of experience to help me decide on how to progress with my treatment. I could not be more pleased with my outcome  and only wish I had done this years ago. I feel amazing and my muscle definition now shines through. After having three kids and feeling like I couldn't exercise enough to see the results I wanted with all the body changes of pregnancy, I was so discouraged. Dr. Allen changed all that. I am so thankful for how she walked me through every detail before and after. I felt informed, cared for personally, and celebrated. Dr. Allen is the absolute best there is. I wouldn't go to anyone else.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "J. P.", "date": "12/02/2019", "avatar": "", "rating": "", "title": "Her artistic touch is superior......natural and beautiful.  Couldn't be happier!", "description": "Dr. Allen and her staff are amazing.  She is so talented and the only provider I trust for my aesthetic needs, I travel out of state just to see her.  I couldn't be more happy with my results, from dysport injections, to filler, and body contouring.  She is truly an artist and her work has given me that extra boost of self confidence as I age.  I would highly recommend her!  If your thinking twice about a procedure, don't  You are worth it, and I promise you'll be more than pleased with your results. Trust her advice and recommendations her work is both natural and beautiful!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "11/18/2019", "avatar": "", "rating": "", "title": "Love Love Love", "description": "I love love love the way Dr. Allen makes me look.  I am at the age where I need just a little TLC.  Dr. Allen takes the time to discuss my areas of concern and offers suggestions of remedies that I never knew were possible.  She never overdoes it, so I always look fresh and natural.  You never leave looking like those people you can tell \"have had a lot of work done.\"", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "W. P.", "date": "11/13/2019", "avatar": "", "rating": "", "title": "Dr. Allen is THE BEST!", "description": "Great", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "T. O.", "date": "11/11/2019", "avatar": "", "rating": "", "title": "liposuction knees", "description": "Dr. Allen was wonderful from my pre-surgical consultation thru my post-surgical follow ups. Dr. Allen made me feel comfortable and I felt she understood what my concerns were. I am very pleased with my overall experience and results.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "11/11/2019", "avatar": "", "rating": "", "title": "Master in her craft", "description": "Dr Allen is a true master at her craft. Her attention to detail and the your end result is amazing! Beyond thrilled with my results.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "A. G.", "date": "11/05/2019", "avatar": "", "rating": "", "title": "Amazing Results", "description": "I came to Dr. Allen for Botox and filler. I have had Botox treatments for years, but new to filler, and felt nervous about the process and results. Dr. Allen was wonderful in walking me through the entire process. I trusted her judgment and expertise and am thrilled with my results. I cannot recommend Dr. Allen highly enough.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "N. B.", "date": "11/05/2019", "avatar": "", "rating": "", "title": "Always good results!", "description": "Dr. Allen is a competent, skilled, talented doctor.  I have been using her for botox injections and some times for a little bit of fillers.   She has always given me very natural results, exactly what I have asked for.   I have used her for a few rounds of IPL over the years and been happy with the results there too.  I have  been seeing her for over 6 years and always been happy with her professionalism, friendliness and skill!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "10/29/2019", "avatar": "", "rating": "", "title": "Dr, Allen is amazing, I love her!", "description": "Dr, Allen, listens to what i want and helps me to age gracefully. She does not push anything on me, she gives suggestions and then we discuss it and I decide what I want to do.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "10/29/2019", "avatar": "", "rating": "", "title": "So Happy!", "description": "I had gone to a different doctor 2 years prior to coming to see Dr. Allen.  It was such a bad experience and I was in a ton of pain.  With the bad experience, my results were bad.  I needed them to be fixed. I found Dr. Allen on Instagram and decided to give her a try. All I can say is WOW! What a great experience it was and my results are beautiful.  My down time was minimal.  I could not believe how great it was. So grateful I found Dr. Allen.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "10/09/2019", "avatar": "", "rating": "", "title": "Very trustworthy Dr. with a very friendly office staff.", "description": "I would recommend Dr. Allen to anyone interested in a Dr.with an artistic eye, great listening skills, professional yet friendly bedside manner, and whom provides great results.  I have been a very happy Portica Body and Face patient for approximately 8 months.  5 stars all around!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Michele B.", "date": "10/08/2019", "avatar": "", "rating": "", "title": "Everything from beggining to end has been wonderful", "description": "I have seen Dr. Allen for several years and have had several procedures done with her.  From the moment I met her I felt so comfortable and in such good hands.  My results from my procedures have been excellent.  My recovery went well and I get lots of positive comments about my shape.  Im so happy I found her and I have sent my friends to see her as well. Her office help Samantha is so wonderful too.  She always gives me extra attention and makes sure I'm all taken care of.  Its a lovely office.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "L. K.", "date": "10/08/2019", "avatar": "", "rating": "", "title": "I love Dr. Allen, she is awesome to work with and very kind.", "description": "I felt heard and very comfortable. All in all it was a very good experience. Dr Allen went out of her way to make it possible for me to do this. I'm glad I did.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "C. J.", "date": "10/08/2019", "avatar": "", "rating": "", "title": "I Love Dr. Allen", "description": "I have been coming to Dr. Allen since 2012 and will continue to make the drive from Utah County because she is so worth it! She is genuinely kind and listens to my concerns and then gives her opinion on what she believes my best options are without trying to push any specific procedure. She specializes in natural looking results which is important to me and that is what she delivers. The staff is always welcoming, helpful and easy to work with too. I 100% recommend Dr. Allen.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "10/01/2019", "avatar": "", "rating": "", "title": "Acne scars", "description": "I've had acne scars for the last 15 years, and have been so self conscious of them.  I was elated when I came across the results of Bellafil and the services that Dr Allen provides.  She took the time to explain the type of filler and what the results would be.  I noticed an immediate difference in the appearance of my scars after the filler injections. I'm so happy with the results thus far.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Alison H.", "date": "09/30/2019", "avatar": "", "rating": "", "title": "wonderful and professional", "description": "I love coming in to see Dr. Allen.  She is professional, thorough, supportive and genuine.  My experience has been nothing but top notch.  I don't have to wait long, she gives me advice and does not suggest anything that is unwarranted. I would highly recommend her to anyone.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Sherri B.", "date": "09/30/2019", "avatar": "", "rating": "", "title": "Amazing - Six years of amazing work", "description": "I have been coming to Dr. Allen for 6 years, and I will not go to anyone else (well, I live out of Utah so sometimes i'm forced to see someone else, but I always hate it.)", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "A. H.", "date": "09/23/2019", "avatar": "", "rating": "", "title": "Dr. Allen is a true artist!", "description": "From the moment I met Dr. Allen, she was a great listener and  attentive. She took my areas of concern and turned them into a master piece. Not only is she good at what she does, but she looks at every detail to make just right for you! This was my best experience by far with any plastic surgeon.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Robyn P.", "date": "09/19/2019", "avatar": "", "rating": "", "title": "Superb Results and Amazing Customer Service", "description": "I have been coming here for years, and each time is a wonderful experience with amazing results. Dr. Allen spends quality time with me and helps me to look and feel my best. I will never go anywhere else!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Cassie J.", "date": "09/22/2020", "avatar": "", "rating": "", "title": "I trust Dr. Allen to give me the exact results I want.", "description": "What I love about Dr. Allen is that she understands what it means to maintain a natural look. I'm not trying to look like I'm in my twenties, I want to look great for my age and this is exactly how I feel when I leave her office. I have been going to Portica for over eight years and I have never been disappointed with any of her recommendations or work.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Elizabeth P.", "date": "07/14/2020", "avatar": "", "rating": "", "title": "Absolutely amazing results", "description": "Dr. Allen is extremely professional.  She takes the time to listen to what the patient wants then delivers in a way only a true artist can.  Her eye for perfection is unmatched.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Heather W.", "date": "07/14/2020", "avatar": "", "rating": "", "title": "I had a great experience with Dr. Allen at Portica.", "description": "I loved my experience at Portica.  Dr. Allen and her staff are kind and professional.  Dr. Allen has a wonderful bedside manner.  I am very happy with my results and would reccomend Portica to anyone.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "N. K.", "date": "07/13/2020", "avatar": "", "rating": "", "title": "Wonderful experience exceeded expectations", "description": "Dr. Allen provided me with great advice and beautiful results with minimal discomfort. I am so very happy with the experience.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Michelle M.", "date": "07/07/2020", "avatar": "", "rating": "", "title": "fabulous doctor!", "description": "Painless!!! I was so worried about getting anything done because of the pain. Dr. Allen did everything she could to ensure I was relatively pain free. I would recommend her to anyone.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "T. L.", "date": "07/01/2020", "avatar": "", "rating": "", "title": "My experience with Dr. Allen was absolutley wonderful and I'm extremely happy with the results of my treament.", "description": "I'm extremely happy and satisfied with my overall experience with Dr. Allen. hthe atmosphere of her clinic was relaxing and comfortable.  Dr. Allen took an incedible amount of time listening to me and what kind of work I wanted done.  The procedures were almost painless and the results were even better than i could have imagined.  Dr. Allen is so skillful and has the ability ti listen and deliver better than any other doctor I have used for these procedures.  She is simply the BEST.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "06/22/2020", "avatar": "", "rating": "", "title": "This resolved an appearance area that had plagued me for years", "description": "Dr. Allen is an absolute artist and professional. I would recommend her to anyone. I felt safe, protected and fully cared for at all times and am beyond delighted with the results.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Heather W.", "date": "06/15/2020", "avatar": "", "rating": "", "title": "My experience at Portica and Dr. Allen has been amazing and positive.", "description": "Dr. Allen did the procedure of liposuction on me to the front and inner thigh.  The procedure was smooth and effective.  Dr. Allen's bedside manner is amazing.  She is kind, thoughtful, and attentive.  I am so happy with the outcome of my procedure, and I would highly recommend Portica and Dr. Allen.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "03/10/2020", "avatar": "", "rating": "", "title": "The very BEST", "description": "I fly in from California just to see Dr. Allen.  I don't trust anyone else with my face!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "02/13/2020", "avatar": "", "rating": "", "title": "What would I do without Dr. Allen?", "description": "Dr. Allen is one of my favorite people - I'm so grateful for her professional manner and her ability to work with me and help me feel better about myself.  Her office is clean, beautiful and a space to relax in.  Her staff is professional and kind.  I feel very comfortable here and know I'm in good hands.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "S. A.", "date": "02/10/2020", "avatar": "", "rating": "", "title": "absolutely the best!", "description": "Dr Allen is truly great at what she does!  Her office and staff, Sam, are always welcoming.  Very genuine people and place to be taken care of.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Kymberly F.", "date": "01/23/2020", "avatar": "", "rating": "", "title": "A one of a kind surgeon.  Warm, welcoming and professional.", "description": "I have been to Dr. Allen on several occasions and each visit is professional and the top level.  I wouldn't even consider going to anyone else.  Her warm and welcoming personality put me at ease and I know I am in good hands.  I couldn't ask for someone that not only listens to my concerns but produces results I could never have imagined.  I leave Dr. Allen's office feeling confident, happy and beautiful knowing that the best and finest hands were working on me to give me the confidence and extra boost I need.  I recommend her to everyone!  I want everyone to have the experience that I encounter every time I step into her office.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Ally Y.", "date": "01/06/2020", "avatar": "", "rating": "", "title": "You'll not regret coming here for all of your skincare and body needs", "description": "I've followed Dr Allen's clients and work for 2+ years.  I've also been considering making changes to my body for a long time.  I've consulted with other surgeons and hands down Dr. Allen is the best.  Her work is beautiful.  She took great time and care to help me get the results I was hoping for and more.  My pain was managed very well and 4 weeks out, I'm very happy.  I'm planning on a phase 2 in the coming months and will only come to her!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "J. J.", "date": "12/11/2019", "avatar": "", "rating": "", "title": "Take a deep breath, you can trust this dr!", "description": "It's hard to know who to trust when it comes to aesthetic procedures... will I like this? Is my best-friends-sister really know the \"duck lip\" warnings? lol... Jennifer will listen to what your concerns are, explain your different options, and then you can choose what to go with.  And the best part? You NEVER even look like something has been done.  You just suddenly look like you've slept for the first time in 8 years and are a perfectly refreshed version on you.  I complete trust Dr. Allen and wouldn't go anywhere else!  She is fantastic!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "11/18/2019", "avatar": "", "rating": "", "title": "Artistic Drs are hard to find. Dr Allen is fantastic", "description": "She is focuses on perfecting the areas that are important to you and has an artistic eye that makes what she does look fantastic", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "11/13/2019", "avatar": "", "rating": "", "title": "A nice experience", "description": "I was in good hands", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Brittany B.", "date": "11/12/2019", "avatar": "", "rating": "", "title": "Amazing in every way!", "description": "Dr. Allen is truly the best in the business. She listened to  what my concerns were and really made me feel at ease. Going to Dr.'s for such personal stuff can be scary, but Dr. Allen makes you feel comfortable. My results turned out amazing, and i could not be more thrilled. Thank you!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "11/11/2019", "avatar": "", "rating": "", "title": "A great experience all around!", "description": "Dr. Allen is a very caring, competent doctor. I deal with anxiety when having any kind of procedure. Dr. Allen talked to me on the phone several times and was very reassuring and helpful.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "11/11/2019", "avatar": "", "rating": "", "title": "The most amazing doctor I have ever worked with", "description": "Dr Allen was so kind and patient and spent the entire day with me making sure I was comfortable. The results I have seen already a few days already are amazing. She is an artist.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anne H.", "date": "11/05/2019", "avatar": "", "rating": "", "title": "Incredible work", "description": "Dr. Allen was sensitive with her recommendations while detailed in her suggestions. I'm beyond impressed with what she was able to accomplish.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "11/04/2019", "avatar": "", "rating": "", "title": "Amazing results and fabulous doctor and staff", "description": "My experience with Dr. Allen and her practice has been an amazing.  I traveled in from DC for my procedures and Dr. Allen worked with me so that having the liposuction performed two thousand miles away from my home wasn't an issue.  Dr. Allen and her nurse both made themselves available to me with their mobile cell phones over the weekend in case I had any related concerns that I needed addressed.  I am beyond pleased with the results.  Dr. Allen listened to me while I discussed my problem areas and she also made some additional suggestions, too.  I'll be back in 3 months for round #2!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Leslie H.", "date": "10/29/2019", "avatar": "", "rating": "", "title": "Fabulous experiences with Dr. Allen and her wonderful assistant, Samantha!", "description": "I have been a patient of Dr. Allen for the past eight years and have absolute confidence in her skills. My results from treatments have been excellent. I especially appreciate her professional yet personable manner. I have recommended her to friends who also share my positive experiences.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Mary C.", "date": "10/29/2019", "avatar": "", "rating": "", "title": "fabulous calming experience", "description": "Everything Id hoped for and more.  Dr. Allen is a consummate professional.  She always takes time to educate and inform me and is obviously concerned with my outcomes and satisfaction. I'm very happy with my outcomes of my cosmetic procedures both on my face and on my body.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "June L.", "date": "10/09/2019", "avatar": "", "rating": "", "title": "Portica truly is exceptional", "description": "i have been a patient at Portica since its inception.  It is the best care I have received for medical cosmetic assistance.  Dr Allen is both skilled and caring.  I greatly appreciate her advice and her procedures.  i look younger and love the results.  I am a return patient, and I'll be coming back.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Anonymous", "date": "10/08/2019", "avatar": "", "rating": "", "title": "SHE IS INCREDIBLE...NUFF SAID!", "description": "I have had multiple rhinoplasties from breaking my nose. My surgeons have had to not only make cuts on my nostrils leaving them flattened and retracted but also destroying my lips in the process to where they don't curl out in a feminine way anymore. Getting this procedure with Dr. Allen has given me back confidence and I got back my nostrils today! I now have more balance to my face and other areas of my nose that were making me self conscious. I am so grateful to her and her clinic. She is an artist.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "K. B.", "date": "10/08/2019", "avatar": "", "rating": "", "title": "Great Experience", "description": "My appointment with Dr. Allen today was great! She not only took the time to listen to my concerns but also didn't push me to do anything... which was a stark contrast to some other office's that I have visited in the past! Overall great experience :)", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "E. M.", "date": "10/07/2019", "avatar": "", "rating": "", "title": "Makes you feel at ease and comfortable", "description": "Jen is excellent. She is a true expert in her field and I knew I could trust her recommendations to bring out a more natural, beautiful finish. She even helped make recommendations on who to talk to about a procedure that she does not currently offer.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "Amanda C.", "date": "09/30/2019", "avatar": "", "rating": "", "title": "The subtleness I wanted", "description": "I come to Dr. Allen for everything because I am a timid client that doesn't want anything to noticeable.  She always takes the time to understand what I'm hoping for and gives me exactly what I want... and she ALWAYS follows up after my treatments.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "K. W.", "date": "09/30/2019", "avatar": "", "rating": "", "title": "excellent care", "description": "I have had nothing short of amazing care with Dr. Allen.  Her knowledge and experience are top-notch and her kind personality is an added bonus.  I recommend her care and office 100%.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "A. B.", "date": "09/30/2019", "avatar": "", "rating": "", "title": "Dr. Allen Is the BEST!!!", "description": "I have had multiple things done at Dr. Allen's office.  She is always the nicest, most professional person. I can't say enough good about her. I never felt dumb for asking questions and she is always helpful and professional. If you are considering getting something done with her.. DO. IT!  You will not be disappointed. Dr. Allen has become someone I can talk to and I feel like we are pretty much best friends now.", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}, {"name": "L. G.", "date": "09/19/2019", "avatar": "", "rating": "", "title": "Outstanding care and understanding of my needs.", "description": "Very friendly and willing to listen to my needs. A true professional and outstanding people skills. Love my experience!", "source": "Portica Body & Face - 1400 S. Foothill Dr. Suite 101"}]}