{"website": "Working at Accurate Personnel: 164 Reviews | Indeed.com", "post_site_url": "www.indeed.com", "post_review_link": "www.indeed.com/cmp/Accurate-Personnel/write-review?campaignid=review-this-company-btn-reviews-tab", "biz_logo_link": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/dc70fdea2d8a226326ac6ca21c1a325c", "biz_favicon": "www.indeed.com/images/favicon.ico", "reviews": [{"name": "Shipping and Receiving Clerk (Former Employee)", "date": "October 15, 2020", "avatar": "", "rating": "3.0", "title": "They pay every 2 weeks.  If you need a job right away, they do the best they can to get you one if you have experience.", "description": "Work-life balanceWork-life balance at Accurate Personnel is good if you show up to work and don't call off.Pay & benefitsMy pay and benefits at Accurate Personnel were acceptable.Job security and advancementIn terms of job security at Accurate Personnel, if you show up everyday, you pretty much have a job.ManagementIn general, managers at Accurate Personnel are nice.CultureCollaboration with my colleagues at Accurate Personnel is ok.OverallMy experience working at Accurate Personnel was a good experience.", "source": "Elwood, IL"}, {"name": "Software Engineer (Former Employee)", "date": "February 1, 2021", "avatar": "", "rating": "5.0", "title": "Great work environment in terms of culture and professionalisim.", "description": "They will work with you to find a nice stable job for you if you need help and willing to work accurate is the place for you. 100% accurate job employement agency.", "source": "California"}, {"name": "Payroll Manager (Former Employee)", "date": "January 28, 2021", "avatar": "", "rating": "1.0", "title": "Covid", "description": "They will give you Covid and then terminate you. This place has so many manual processes and the owners run this place like a sweatshop. Antiquated systems geared for billing not for the client. When the entire company has to pitch in to help payroll, this should be a sign. Change the processes. Manager has no management skills. You are never given expectations surrounding the position. Watch out while on vacation because they may want you to work. They also lie for their benefit", "source": "Schaumburg, IL"}, {"name": "Manager (Former Employee)", "date": "October 28, 2020", "avatar": "", "rating": "2.0", "title": "Owners need to take back their company", "description": "Until the Operational Leadership is replaced, do not waste your time. EDO is in way over her head and ownership allows her to have control of too many things. Nepotism with her cohort runs rampant, and the treatment of employees leads to massive turnover and an overall toxic work environment.  The \"Mean Girls\" are going to run this place into the ground, and ownership seems to turn a blind eye. The best this place has to offer leave, and anyone that knows what they are doing and seems to be threat, will not be listened to and will be let go for no reason. The two ladies that seem to be calling the shots and chasing away the talent, would be lucky to be area and regional managers at any \"real\" regional, national, or global staffing agency. The COO let's it happen and protects her, and rumors of the extent of the \"relationship\" with the EDO seems to be the reason, and ownership is kept in the dark, or just blind to what is really happening. Terrible training, low pay, and leadership by intimidation is what you get!  Run fast!", "source": "Chicago, IL"}, {"name": "Applied Behavior Analyst (Former Employee)", "date": "September 14, 2020", "avatar": "", "rating": "1.0", "title": "Very Rude People.....", "description": "Very rude people....!specially Fernando Galarza Jr who just hang up the phone very rude.Stay away from this....agency recruit you without benefits then dump you when you're not needed.", "source": "Miami, FL"}, {"name": "Packer (Current Employee)", "date": "June 15, 2020", "avatar": "", "rating": "5.0", "title": "understanding workplace and room for improvement", "description": "overall, they were helpful and understanding. On my first day, my daughter had a car accident and they understood that I had to leave work. I continued the job the next day.", "source": "Indianapolis, IN"}, {"name": "Associate (Former Employee)", "date": "May 28, 2020", "avatar": "", "rating": "1.0", "title": "Job sumnary", "description": "Not the best but they always found me a job. I would recommend if you really needed a job. But the pay isn’t really worth the labor. If you looking for quick money this is for you", "source": "Chicago, IL"}, {"name": "Laborer (Former Employee)", "date": "May 17, 2020", "avatar": "", "rating": "5.0", "title": "Everything", "description": "They are very considerate to their staff and employee..They work great with location and hours that you work.Plus they are very people friendly ..Great place.", "source": "Statesville, NC"}, {"name": "Assistant Housekeeping Supervisor (Former Employee)", "date": "April 8, 2020", "avatar": "", "rating": "5.0", "title": "A great company", "description": "I have worked for temporary jobs for many years and Accurate is one of the best from start to finish. Great people and great assignments and good pay and benefits.", "source": "Orange Beach, AL"}, {"name": "Account Manager (Former Employee)", "date": "March 3, 2020", "avatar": "", "rating": "1.0", "title": "Don’t waste your time or brain cells", "description": "If you have any formal education, do not waste your time with the company. Management is inexperienced, which leads to poor leadership. Pay is well below the nation’s average. We were forced to clean our own office and handle biohazards waste (urine from drug tests) none of this was told to during interview. We were forced to pass people who failed drug tests. Corporate micromanages from the shadows. The turnover internally is ridiculous. This company is the epitome of unprofessional. Proceed with a caution.", "source": "Florida"}, {"name": "Business Development Specialist (Current Employee)", "date": "February 25, 2020", "avatar": "", "rating": "5.0", "title": "Great company to work for.", "description": "Accurate Personnel has advancement opportunities. I have learned many things working for this company. There is also work/family life balance. Overall, i have been happy working for Accurate and can recommend working there.", "source": "Miami, FL"}, {"name": "Reach Truck Operator (Former Employee)", "date": "February 18, 2020", "avatar": "", "rating": "5.0", "title": "productive work environment", "description": "I feel like it is a good temp agency to work with they also have great customer service they work with you and try to help you out to be able to work in a work place that fix you", "source": "Bloomfield, CT"}, {"name": "Account Manager (Former Employee)", "date": "February 14, 2020", "avatar": "", "rating": "2.0", "title": "Potential to be great very slow", "description": "* Very 9-5 job unless random weekend work needed\r* Manager customer service is horrible with recruits\r*Management is out for themselves solely\r* Slow branch very poor billing \r* Sales person turnover is outrages went through 2 in 7 months\r*  Will be enforced to do work out of your job description\r* weekly pay is reliable\r* Medical benefits are very poor\r*Great if you just don't want to truly care about what your job purpose is, which is to help people go back to work.", "source": "Orlando, FL"}, {"name": "Staffing Coordinator (Former Employee)", "date": "February 10, 2020", "avatar": "", "rating": "5.0", "title": "I loved working at Accurate.", "description": "I love working at Accurate.  It is a great company.  I loved my co-workers.  They would help me succeed.  I learned so much from them. I was receptionist and then became a recruiter.", "source": "Wood Dale, IL"}, {"name": "Cooler pull (Former Employee)", "date": "February 7, 2020", "avatar": "", "rating": "1.0", "title": "They are bias and dont care about your work ethics", "description": "They cater to bilingual people which is fine they let me go for nothing they use you for eight months and let you go im a company that care about your work ethics so im not missing that placectually working for a", "source": "Cooler pull"}, {"name": "Branch Manager (Current Employee)", "date": "February 6, 2020", "avatar": "", "rating": "5.0", "title": "Family Owned Business! 2nd Generation. Great Place!", "description": "Great place to work! Lot's of help and resources, very rewarding with opportunities to move up within the company. Growth year over year. Loving helping others find a position they love and deserve. Love being surrounding by successful hard working people.", "source": "Crystal Lake, IL"}, {"name": "Logistics Specialist (Former Employee)", "date": "January 16, 2020", "avatar": "", "rating": "3.0", "title": "comfortable", "description": "Fast paced customer service representative. Repetitive but steady work. Staffing agency assignment for the convenience of schedule and availability. Friendly and clean.", "source": "Chicago, IL"}, {"name": "Temp Worker (Former Employee)", "date": "December 26, 2019", "avatar": "", "rating": "4.0", "title": "real nice and helpfull", "description": "accurate personnel is really helpful and understanding with the shifts, hours, and locations and will work with you to find a nice stable job for you if you need help and willing to work accurate is the place for you.", "source": "Elgin, IL"}, {"name": "Bread selector (Former Employee)", "date": "December 14, 2019", "avatar": "", "rating": "1.0", "title": "Terrible environment to work in", "description": "U get treated like trash by the lead guys lots of disrespect in the location where their employer is.also make sure ur check is not short or they take months to pay you. Sometimes u won’t even see that check for the difference.", "source": "Bloomfield, CT"}, {"name": "Packing (Former Employee)", "date": "December 12, 2019", "avatar": "", "rating": "3.0", "title": "Nice people to work with", "description": "It was a Wonder full working for this company that accurate send me they did use to care for their employees unfortunately the company have close down.", "source": "Elgin, IL"}, {"name": "Warehouse Picker (Former Employee)", "date": "December 8, 2019", "avatar": "", "rating": "5.0", "title": "Accurate", "description": "This Temp to hire company was very useful,kept me busy and working. I have 0 complaint with/about them. The management was very polite and useful. I was very happy hear at this company.", "source": "Cincinnati, OH"}]}