{"website": "Lilo’s Carpet and Cleaning Services - Salt Lake City, UT", "post_site_url": "www.thumbtack.com", "biz_logo_link": "", "biz_favicon": "https:/https://cdn.thumbtackstatic.com/fe-assets-rr/components/global-head/logomark/black/transparent/fav.b6995f81fb989d2abd8e2258c53af2eb.ico", "post_review_link": "https://www.thumbtack.com/ut/salt-lake-city/carpet-cleaning/lilos-carpet-cleaning-services/service/358313871403499535?service_pk=358313871403499535&category_pk=219264413294461288&project_pk=411595281081245698&lp_request_pk=411595281117151245&zip_code=84010&click_origin=pro%20list%2Fclick%20pro%20name&sourcePage=&sourceEvent=", "reviews": [{"name": "Tucker R.", "date": "Jul 24, 2020", "avatar": "", "rating": "5", "title": "", "description": "Their team did a great job! They showed up and I took 2 minutes to explain what I wanted and had to leave. They texted me an hour and a half later saying they were done, and I was worried thinking, “hmmm, that was pretty fast for how dirty it was....”. Got home and exceeded my expectations. House is sparkling clean! Will be using again.", "source": ""}, {"name": "Jim J.", "date": "Mar 7, 2020", "avatar": "", "rating": "5", "title": "", "description": "These fold are so nice. They showed up to a mess after my renters moved out. When they arrived they were like a machine. The 3 of them went through the house knowing exactly how was doing what. When they left the house sparkling clean. The carpets done and the house looked fabulous. The kitchen and all appliances looked new the bathrooms sparkled and the carpets I thought would never come clean well they did. We we’re getting the house ready for new renters and a potential buyer. It was so clean I thought about keeping it for myself however we’re not. The new renters/buyers saw it and loved it. If you want your house to sparkle call these folks. You won’t regret that you did.", "source": ""}, {"name": "Eve C.", "date": "Jan 23, 2021", "avatar": "", "rating": "5", "title": "", "description": "Right on time SO appreciated.  Wonderful cleaning just amazing!  She is so sweet and I look forward to have her back next time!", "source": ""}, {"name": "Kylee K.", "date": "Dec 30, 2019", "avatar": "", "rating": "5", "title": "", "description": "So grateful to Lilos cleaning service. They were super easy to schedule and reasonably priced. Did a great job deep cleaning my house to help prepare for our baby’s arrival. Would definitely use again!", "source": ""}, {"name": "Carey D.", "date": "Sep 10, 2020", "avatar": "", "rating": "5", "title": "", "description": "Wow! I can't say enough about the deep cleaning service provided by Lillian and her helper. They were true cleaning professionals in every sense.", "source": ""}]}